android/Squirrel/app/src/main/assets/xml/SetSystemDateAndTime

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Header xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>%s</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">%s</wsse:Password>
        <wsse:Nonce>%s</wsse:Nonce>
        <wsu:Created>%s</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </s:Header>
 <soap:Body>
     <tds:SetSystemDateAndTime>
       <tds:DateTimeType>Manual</tds:DateTimeType>
       <tds:DaylightSavings>true</tds:DaylightSavings>
       <tds:TimeZone>
         <tt:TZ>PST8PDT,M3.2.0/2,M11.1.0/2</tt:TZ>
       </tds:TimeZone>
       <tds:UTCDateTime>
         <tt:Time>
           <tt:Hour>%s</tt:Hour>
           <tt:Minute>%s</tt:Minute>
           <tt:Second>%s</tt:Second>
         </tt:Time>
         <tt:Date>
           <tt:Year>%s</tt:Year>
           <tt:Month>%s</tt:Month>
           <tt:Day>%s</tt:Day>
         </tt:Date>
       </tds:UTCDateTime>
     </tds:SetSystemDateAndTime>
   </soap:Body>
</soap:Envelope>